Revit 2027 API
DirectShape.SetTypeId Method
 Sets the DirectShapeType for the DirectShape element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTypeId(
	ElementId typeId
)
Public Sub SetTypeId (
	typeId As ElementId
)
public:
void SetTypeId(
	ElementId^ typeId
)
member SetTypeId :
        typeId : ElementId -> unit
Parameters
typeId ElementId
 The ID of the type corresponding to this DirectShape element. May only be set once.
Exceptions
Exception | Condition
ArgumentException |  typeId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace